liguobao/esp32-homekit-devices/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_hap.csv"
CONFIG_FREERTOS_UNICORE=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_MAX_ACTIVE_TCP=12
CONFIG_LWIP_MAX_LISTENING_TCP=12
CONFIG_LWIP_UDP_RECVMBOX_SIZE=10
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_LWIP_AUTOIP=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_LWIP_AUTOIP_RATE_LIMIT_INTERVAL=60
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_APP_WIFI_USE_PROVISIONING is not set
CONFIG_APP_WIFI_USE_HARDCODED=y
CONFIG_EXAMPLE_USE_HARDCODED_SETUP_CODE=y
CONFIG_EXAMPLE_SETUP_CODE="111-22-333"
CONFIG_EXAMPLE_SETUP_ID="C3HK"
